Tekla.Structures.Geometry3d.AABB.#ctor(System.Collections.Generic.IEnumerable{Tekla.Structures.Geometry3d.Point})
Constructs AABB from given point list.
Points:

Tekla.Structures.Geometry3d.AABB.GetCornerPoints
Returns all corner points of the current axis-aligned 3d bounding box.
Returns: All corner points of the current axis-aligned 3d bounding box.